# Series

In [4]:
import pandas as pd

series_test = pd.Series([100.0, 200, 300])

series_test

0    100.0
1    200.0
2    300.0
dtype: float64

In [6]:
series_test = pd.Series({1999: 100.0, 
                         2001: 200.0, 
                         2006: 300.0})

series_test

1999    100.0
2001    200.0
2006    300.0
dtype: float64

# DataFrames

In [9]:
frame_test = pd.DataFrame({1999: [74, 38, 39],
                           2000: [56, 78, 69],
                           2005: [77, 98, 19]})
frame_test

   1999  2000  2005
0    74    56    77
1    38    78    98
2    39    69    19

In [14]:
frame_test2 = pd.DataFrame([[74, 38, 39],
                            [56, 78, 69],
                            [77, 98, 19]], columns=[1999, 2000, 2001])
frame_test2

   1999  2000  2001
0    74    38    39
1    56    78    69
2    77    98    19